[{"id": 2094, "category": 1, "difficulty": 1, "text": "Was versteht man unter der Abkürzung DDL?", "explanation": "DDL (Data Definition Language):\n\nDie DDL stellt Sprachelemente zur Verfügung, mit denen die Datenbankobjekte definiert, modifiziert und gelöscht werden. Einsatzgebiet ist die konzeptionelle Ebene im ANSI-3-Ebenen-Modell.", "type": "text", "answers": [{"text": "Man versteht darunter:", "solution": "Data Definition Language"}]}, {"id": 2095, "category": 1, "difficulty": 1, "text": "Was versteht man unter der Abkürzung DML?", "explanation": "DML (Data Manipulation Language):\nDie DML stellt Sprachelemente zum Anlegen, Ändern und Löschen von Daten zur Verfügung. Einsatzgebiet ist die externe Ebene im ANSI-3-Ebenen-Modell.", "type": "text", "answers": [{"text": "Man versteht darunter:", "solution": "Data Manipulation Language"}]}, {"id": 634, "category": 4, "difficulty": 2, "text": "In welcher Phase des Vorgehensmodells der Datenbankentwicklung wird ein ER-Modell erstellt?", "explanation": "In der Analysephase werden die Systemfunktionen und Daten in groben Zügen geplant und festgelegt. Es wird eine explizite Systemdefinition in Form eines Lastenhefts vorgenommen. Dies geschieht umgangssprachlich in einer auch für Laien lesbaren Form. Außerdem werden die Daten mit Mitteln der Softwaretechnik, hier mit dem Entity-Relationship-Modell (kurz: ERM oder ER-Modell), genau beschrieben. Das ERM entspricht dem konzeptionellen Modell aus dem ANSI-3-Ebenen-Modell.", "type": "multiple-choice", "answers": [{"text": "Implementierungsphase", "solution": "false"}, {"text": "Analysephase", "solution": "true"}, {"text": "Entwurfsphase", "solution": "false"}]}, {"id": 635, "category": 4, "difficulty": 1, "text": "In welcher Phase des Vorgehensmodells der Datenbankentwicklung wird das ER-Modell auf ein relationales Datenbankschema abgebildet?", "explanation": "In der Entwurfsphase wird das konzeptionelle Schema auf ein relationales Datenbankschema abgebildet und eine Normalisierung durchgeführt. Außerdem wird bei einer geplanten Anwendungsentwicklung \nein objektorientiertes Klassenmodell erstellt, das die für die Datensicht erforderlichen Methoden und Funktionen enthält.", "type": "multiple-choice", "answers": [{"text": "Analysephase", "solution": "false"}, {"text": "Entwurfsphase", "solution": "true"}, {"text": "Implementierungsphase", "solution": "false"}]}, {"id": 2454, "category": 5, "difficulty": 3, "text": "Bei welchen Beziehungen tauchen Fremdschlüsselattribute in den Entity-Mengen des ERDs auf, die an der Beziehung beteiligt sind?", "explanation": "Bei n-m-Beziehungen entstehen die Fremdschlüsselattribute beim Auflösen in einer neuen Entity-Menge, nicht in den ursprünglicheen Entity-Mengen.", "type": "multiple-choice", "answers": [{"text": "1:1-Beziehungen", "solution": "true"}, {"text": "1:n-Beziehungen", "solution": "true"}, {"text": "m:n-Beziehungen", "solution": "false"}]}, {"id": 654, "category": 5, "difficulty": 1, "text": "Wann heißt eine 1:n-Beziehung identifizierend?", "explanation": "Bei identifizierenden Beziehungen wird in der Detail-Entitymenge der Fremdschlüssel zum Primärschlüssel hinzugenommen, bei nicht identifizierenden Beziehungen wird der Fremdschlüssel nur als Attribut eingetragen, welches nicht zum Primärschlüssel der Relation gehört.", "type": "multiple-choice", "answers": [{"text": "Die Primärschlüsselattribute der Detail-Entity-Menge treten als Bestandteile des Primärschlüssels bei der Master-Entity-Menge auf.", "solution": "false"}, {"text": "Die Primärschlüsselattribute der Master-Entity-Menge treten als Bestandteile des Primärschlüssels bei der Detail-Entity-Menge auf.", "solution": "true"}, {"text": "Die Primärschlüsselattribute der Master-Entity-Menge treten als Fremdschlüssel-Attribute bei der Detail-Entity-Menge auf und sind aber kein Bestandteil des Primärschlüssels.", "solution": "false"}]}, {"id": 2008, "category": 5, "difficulty": 1, "text": "Ternäre Beziehungen lassen sich immer in binäre Beziehungen auflösen, ohne eine Entity-Menge hinzuzufügen.", "explanation": "Um ternäre Beziehungen in binäre Beziehungen aufzulösen, braucht man eine zusätzliche Entity-Menge.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "false"}, {"text": "stimmt nicht", "solution": "true"}]}, {"id": 2011, "category": 5, "difficulty": 2, "text": "Welche Aussagen über das EERM sind wahr?", "explanation": "Eine IS-A-Beziehung ist eine Beziehung zwischen einem Supertyp und einem Subtyp, wobei der Subtyp alle Attribute des Supertyps erbt, die um eigene Attribute und Beziehungen ergänzt werden können. \nEin weiterer wichtiger Beziehungstyp ist die Aggregation, die die \"Ist Teil von\" Beziehung beschreibt. Mithilfe dieses Beziehungstyps lassen sich komplexe Objekte modellieren. Beispielsweise ist es möglich, in der ER-Modellierung von Byce & Co. auf die Struktur-Entity-Menge zu verzichten und stattdessen die Bestandteile eines Fahrrads explizit aufzulisten. \nUnter einer Spezialisierung versteht man den Prozess der Gewinnung von Subtypen aus einem gegebenen Supertyp, und unter einer Generalisierung den genau umgekehrten Prozess, die Gewinnung eines Supertypen aus gegebenen Subtypen. \nEin System von Subtypen und Supertypen nennt man vollständig, wenn der Supertyp keine eigenen Elemente enthält, also jedes Element in einem der Subtypen enthalten ist.", "type": "multiple-choice", "answers": [{"text": "Eine IS-A-Beziehung ist eine Beziehung zwischen einem Supertyp und einem Subtyp, wobei der Subtyp alle Attribute des Supertyps erbt, die um eigene Attribute und Beziehungen ergänzt werden können.", "solution": "true"}, {"text": "Eine Aggregation ist eine Beziehung zwischen einem Supertyp und einem Subtyp, wobei der Subtyp alle Attribute des Supertyps erbt, die um eigene Attribute und Beziehungen ergänzt werden können.", "solution": "false"}, {"text": "Unter einer Generalisierung versteht man den Prozess der Gewinnung von Subtypen aus einem gegebenen Supertyp.", "solution": "false"}, {"text": "Unter einer Spezialisierung versteht man den Prozess der Gewinnung von Subtypen aus einem gegebenen Supertyp.", "solution": "true"}, {"text": "Ein System von Subtypen und Supertypen heißt vollständig, wenn die einzelnen Subtypen keine gemeinsamen Elemente haben.", "solution": "false"}, {"text": "Ein System von Subtypen und Supertypen nennt man vollständig, wenn der Supertyp keine eigenen Elemente enthält, also jedes Element in einem der Subtypen enthalten ist.", "solution": "true"}]}, {"id": 2468, "category": 5, "difficulty": 1, "text": "Eine m:n-Beziehung im ERD (ohne beteiligte Entity-Mengen) wird beim Übergang zum DB-Schema in wie viele der folgenden Objekte überführt?", "explanation": "Eine n-m-Beziehung wird bei diesem Übergang in einer Relation und zwei 1:n-Beziehungen aufgelöst, die durch Fremdschlüssel dargestellt  werden.", "type": "multiple-choice", "answers": [{"text": "Eine 1:1-Beziehung und zwei Relationen", "solution": "false"}, {"text": "Zwei 1:1-Beziehungen und eine Relation", "solution": "false"}, {"text": "Zwei 1:n-Beziehungen und eine Relation", "solution": "true"}, {"text": "Zwei 1:n-Beziehungen", "solution": "false"}]}, {"id": 2469, "category": 5, "difficulty": 2, "text": "Folgende Aussagen über Subtypen sind wahr:", "explanation": "Bei Subtypen werden identifizierende Beziehungen verwendet, da Supertyp und Subtyp den gleichen  Primärschlüssel haben", "type": "multiple-choice", "answers": [{"text": "Identifizierende Beziehungen können verwendet werden.", "solution": "true"}, {"text": "Nicht-identifizierende Beziehungen können verwendet werden.", "solution": "false"}, {"text": "Identifizierende und nicht-identifizierende Beziehungen können verwendet werden.", "solution": "false"}, {"text": "Es gibt Entity-Mengen, die aufgrund von 1:n-Beziehungen Fremdschlüssel besitzen, die aus mehreren Spalten bestehen.", "solution": "false"}]}, {"id": 2799, "category": 5, "difficulty": 2, "text": "Welche Aussagen über eine IS-A-Beziehung sind richtig?", "explanation": "Eine \"IS-A-Beziehung\" ist eine Beziehung zwischen einem Supertyp und einem Subtyp \n\u0095 Die Subtypen erben alle Attribute des Supertyps\n\u0095 Die Attribute des Subtyps können um eigene Attribute und Methoden ergänzt werden.\n\u0095 Supertyp und Subtyp besitzen den gleichen Primärschlüssel.", "type": "multiple-choice", "answers": [{"text": "Eine IS-A-Beziehung ist eine andere Bezeichnung für eine identifizierende 1:n-Beziehung.", "solution": "false"}, {"text": "Eine IS-A-Beziehung ist eine andere Bezeichnung für eine nicht-identifizierende 1:n-Beziehung.", "solution": "false"}, {"text": "Eine IS-A-Beziehung ist eine Beziehung zwischen einem Supertyp und einem Subtyp.", "solution": "true"}, {"text": "Bei einer IS-A-Beziehung werden alle Attribute des Subtypen an den Supertyp vererbt.", "solution": "false"}, {"text": "Supertyp und Subtyp haben die gleichen Primärschlüsselattribute und auch -werte.", "solution": "true"}]}, {"id": 3778, "category": 5, "difficulty": 1, "text": "Bei welcher/n Entity-Mengen sind bei m:n-Beziehungen die Fremdschlüssel einzutragen?", "explanation": "Bei einer m:n-Beziehung werden dei Fremdschlüssel später in einer Zwischentabelle ausgelagert.", "type": "multiple-choice", "answers": [{"text": "Nur m-Ende", "solution": "false"}, {"text": "nur n-Ende", "solution": "false"}, {"text": "Beide Enden", "solution": "false"}, {"text": "Keine Fremdschlüssel  in den Entity-Mengen", "solution": "true"}]}, {"id": 547, "category": 8, "difficulty": 3, "text": "Wie nennt man die Anzahl der Attribute einer Relation in der relationalen Algebra? (englischer Ausdruck)", "explanation": "Man schreibt auch: R(A1,...,An). Eine Relation entspricht dabei einer Tabelle mit den Attributen als Spaltenüberschriften. Der Degree ist die Anzahl der Attribute der Relation.", "type": "text", "answers": [{"text": "Die Anzahl der Attribute heißt:", "solution": "Degree"}]}, {"id": 2555, "category": 8, "difficulty": 1, "text": "Bei einer Projektion wird eine n-stellige Relation auf eine (n-m)-stellige Relation abgebildet, mit m>=0.", "explanation": "Die Projektion ist die Operation der RA, die die Ergebnismenge auf einzelne Attribute aus einer Relation beschränken kann.  \nListet man bei der Projektion alle Attributnamen der Relation auf, so wäre das der Fall, dass m=0 ist (eine recht überflüssige Operation, da die Eingangstupelmenge identisch ist mit der Ergebnismenge). Listet man hingegen nur einige Attributnamen auf, so ist m>0.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "true"}, {"text": "stimmt nicht", "solution": "false"}]}, {"id": 2571, "category": 8, "difficulty": 1, "text": "Der Right Outer Join ist kommutativ.", "explanation": "Der rechte Outer-Join (rechter äußerer Join) zweier Relationen R1 und R2 ist ein Join-Operator, bei dem alle Tupel der rechten Relation, hier R2, die im Natural-Join unterdrückt werden, als Tupel mit aufgeführt und in den Attributen, die zu R1 gehören, mit NULL-Werten aufgefüllt werden.\n\nDie rechten und linken Outer-Joins sind nicht kommutativ, da entweder nur die rechte oder nur die linke Relation vollständig mit allen Tupeln in die Ergebnismenge aufgenommen werden. \nDer Full-Outer-Join (beidseitiger, vollständiger äußerer Join) zweier Relationen R1 und R2 ist ist jedoch kommutativ, da bei ihn sowohl die rechte als aich die linke Relation vollständig mit allen Tupeln in die Ergebnismenge aufgenommen werden.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "false"}, {"text": "stimmt nicht", "solution": "true"}]}, {"id": 2567, "category": 8, "difficulty": 3, "text": "Welche Anforderungen muss ein \"vereinigungskonformer\" Operator der relationalen Algebra erfüllen? (relevant für die Durchführung von Mengenoperationen)", "explanation": "Die Forderung in der Relationalen Algebra <a href =\"http://wikis.gm.fh-koeln.de/wiki_db/Datenbanken/Vereinigungskonform\"> vereinigungskonform  zu sein, gilt für alle drei Mengenoperatoren (Vereinigung, Differenz, Durchschnitt). \nDie beteiligten Relationen (Eingangsdatenmengen) müssen die gleichen Attributdefinitionen aufweisen: \nDie Anzahl der Attribute muss übereinstimmen. \nDie Attribute müssen gleich heißen. \nDie Datentypen der der Attribute müssen gleich sein.  \nDie Reihenfolge der Attribute muss übereinstimmen. \nAchtung: In SQL müssen die Spalten nicht auch noch gleich heißen.", "type": "multiple-choice", "answers": [{"text": "Die Attribute müssen gleich heißen.", "solution": "true"}, {"text": "Die Anzahl der Attribute muss übereinstimmen.", "solution": "true"}, {"text": "Die Datentypen der der Attribute müssen gleich sein.", "solution": "true"}, {"text": "Die Reihenfolge der Attribute muss übereinstimmen.", "solution": "true"}, {"text": "Es gibt keine solche Anforderung in der RA.", "solution": "false"}]}, {"id": 2561, "category": 8, "difficulty": 1, "text": "Über welche Eigenschaften verfügt ein binärer Operator in der relationalen Algebra?", "explanation": "Unär:  F1 : Rn -> Rm      mit n , m ∈ N\nBinär: F2 : Rn × Rm -> Rk mit n , m , k ∈ N\nUnäre Operatoren: Selektion, Projektion\nBinäre Operatoren: Kartesisches Produkt, alle Join-Operatoren, alle Mengenoperatoren, Division", "type": "multiple-choice", "answers": [{"text": "Er liefert zwei Ergebnisdatenmengen.", "solution": "false"}, {"text": "Er verarbeitet zwei Eingangsdatenmengen.", "solution": "true"}, {"text": "Die Ergebnisdatenmenge verfügt über zwei Attribute.", "solution": "false"}, {"text": "Die Eingangsdatenmengen verfügen über zwei Attribute.", "solution": "false"}, {"text": "Die Operation wird nur auf zwei Attributen ausgeführt.", "solution": "false"}]}, {"id": 2556, "category": 8, "difficulty": 3, "text": "Wie viele Attribute hat die Ergebnismenge des kartesischen Produkts von zwei Relationen, die über 15 bzw. 25 Attribute verfügen, wobei es in der einen Relation drei Attribute gibt, die gleich heißen wie in der anderen?", "explanation": "Die Struktur der Ergebnismenge des Kartesischen Produkts verfügt über alle Attribute aus beiden beteiligten Relationen: 15+25= 40 Attribute. \nDass drei Attribute in beiden Relationen gleich heißen, spielt keine Rolle für das Kartesische Produkt, sondern lediglich für den Natural Join.", "type": "text", "answers": [{"text": "Das kartesische Produkt hat ... Attribute.", "solution": "40"}]}, {"id": 2558, "category": 8, "difficulty": 2, "text": "Wie viele Tupel hat die Ergebnismenge des Natural Joins von zwei Relationen, die 18 bzw. 20 Tupel beinhalten, wobei es für 14 Tupel der einen Relation Tupel der anderen Relation gibt, die in einem gleichheißenden Attribut die gleichen Werte aufweisen?", "explanation": "Bei einem Natural Join werden automatisch alle Attribute der beiden Relationen, die gleich heißen, auf Gleichheit verglichen und im Ergebnis werden diese Attribute nur einmal aufgelistet. Heißen mehrere Attribute gleich, so werden die einzelnen Gleichheitsvergleiche mit AND verknüpft. Diese Bedingung trifft für 14 Tupel zu.", "type": "text", "answers": [{"text": "Der Natural Join hat ... Tupel.", "solution": "14"}]}, {"id": 1689, "category": 8, "difficulty": 1, "text": "Welche Operation aus der relationalen Algebra setzt den \"Für-Alle-Quantor\" (Allaussage) um?", "explanation": "Mit der Division wird der All-Quantor dargestellt, zum Beispiel werden Anfragen der Gestalt \"Welche Lieferanten liefern alle Materialien?\" beantwortet.", "type": "multiple-choice", "answers": [{"text": "Addition", "solution": "false"}, {"text": "Differenz", "solution": "false"}, {"text": "Division", "solution": "true"}, {"text": "Produkt", "solution": "false"}, {"text": "keine von allen", "solution": "false"}]}, {"id": 2187, "category": 8, "difficulty": 1, "text": "Der Durchschnittsoperator ist aus den Grundoperatoren der relationalen Algebra (Selektion, Projektion, Kartesisches Produkt, Differenz, Union)  ableitbar.", "explanation": "Die Simulation sieht wie folgt aus: \n(A Durchschnitt B)  =  ( A ohne (A ohne B) ) \n\n(A Durchschnitt B)  =  ( A Differenz (A Differenz B) ) \n\nPS: Zeichnen Sie sich ruhig die Venn-Diagramme auf - es hilft ;-) \nPS: War mal Klausuraufgabe :-)", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "true"}, {"text": "stimmt nicht", "solution": "false"}]}, {"id": 2044, "category": 8, "difficulty": 1, "text": "Ein Operatorbaum wächst", "explanation": "Um Anfragen an einen Datenbestand zu formulieren, können Operationen der relationalen Algebra beliebig ineinander geschachtelt werden. Bei komplexen Anfragen ist daher die oben verwendete sogenannte \"Inline-Notation\" schwer lesbar. Für diesen Zweck verwendet man Operatorbäume statt der Inline-Notation. Bei dieser grafischen Darstellung erstellt und liest man die Abfrage von unten nach oben. Operationen, die miteinander verknüpft sind, sind durch Kanten im Graphen miteinander verbunden. Gestartet wird mit den relvanten Relationen als unterster Teil des OP-Baumes.", "type": "multiple-choice", "answers": [{"text": "von unten nach oben", "solution": "true"}, {"text": "von oben nach unten", "solution": "false"}]}, {"id": 1726, "category": 8, "difficulty": 3, "text": "Wie heißen Tupel, die bei einem Natural Join verloren gehen können?", "explanation": "Beim natürlichen Join werden diejenigen Tupel, die nur in einer Relation vorkommen, unterdrückt. Diese Tupel bezeichnet man auch als \"Dangeling\"-Tupel (dangling tuples).", "type": "text", "answers": [{"text": "Diese Tupel heißen (englischsprachiger Begriff, alles kleingeschrieben):", "solution": "dangling tupels"}]}, {"id": 1155, "category": 8, "difficulty": 3, "text": "Eine Menge von Relationen besitzt die Eigenschaft, dass jeder Wert eines Fremdschlüssels einer Relation Wert eines Primärschlüssel in einer anderen Relation ist.", "explanation": "Eine Menge von Relationen R1,...,Rk besitzt die referentielle Integrität, wenn jeder Wert eines Fremdschlüssels einer Relation Ri Wert eines Primärschlüssels in einer anderen Relation Rj ist. Handelt es sich bei den Relationen Ri und Rj um die gleiche Relation, so wird diese Form der Referenz Selbstreferenz oder auch rekursive Referenz genannt.", "type": "text", "answers": [{"text": "Diese Eigenschaft heißt", "solution": "Referentielle Integrität"}]}, {"id": 801, "category": 8, "difficulty": 3, "text": "Welcher Optimierungsvorgang transformiert einen algebraischen Ausdruck der relationalen Algebra auf einen semantisch äquivalenten Ausdruck?", "explanation": "Bei der logischen Optimierung wird ein algebraischer Ausdruck der relationalen Algebra auf einen semantisch äquivalenten Ausdruck transformiert, der weniger Laufzeit benötigt. Je weniger Tupel die Zwischenergebnismengen haben, umso schneller ist die Anfrageauswertung.", "type": "text", "answers": [{"text": "Dies ist die ...", "solution": "logische Optimierung"}]}, {"id": 1133, "category": 8, "difficulty": 1, "text": "Die Division ist kommutativ.", "explanation": "Kartesisches Produkt, Vereinigung, Durchschnitt und Join-Operation sind kommutativ (vertauschbar), die Division aber nicht. \nEs macht sehr wohl einen semantischen Unterschied, ob man die \"Kunden, die alle Artikel gekauft haben\" oder die \"Artikel, die von allen Kunden gekauft wurden\" anfragt.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "false"}, {"text": "stimmt nicht", "solution": "true"}]}, {"id": 1132, "category": 8, "difficulty": 1, "text": "Die Differenz ist kommutativ.", "explanation": "Kartesisches Produkt, Vereinigung, Durchschnitt und Join-Operation sind kommutativ (vertauschbar), die Differenz aber nicht. \nEs macht sehr wohl einen semantischen Unterschied, ob man die \"Artikel ohne Rechnungen\" oder die \"Rechnungen ohne Atrikel\" anfragt.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "false"}, {"text": "stimmt nicht", "solution": "true"}]}, {"id": 1128, "category": 8, "difficulty": 1, "text": "Bei der Division R % S müssen die Attribute von S in den Attributen von R enthalten sein.", "explanation": "Wir betrachten zwei Relationen R und S. Die Attribute von S sollen in den Attributen von R enthalten sein. Die Attribute der Ergebnismenge der Division entsprechen der Differenzmenge X der Attribute von R und S: \nDie Division R ÷ S besteht aus allen Tupeln x aus X, so dass die folgenden beiden Bedingungen für jedes x aus X gelten: \n1. Zu jedem s aus S gibt es eine Fortsetzung r aus R, so dass die Projektion von r auf S gleich s ist. \n2. Die Projektion von r auf X stimmt mit x überein.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "true"}, {"text": "stimmt nicht", "solution": "false"}]}, {"id": 1126, "category": 8, "difficulty": 2, "text": "Wie heißt der Wertebereich eines Attributs?", "explanation": "Sei (A1,..., An) eine Menge von Attributen mit den Wertebereichen Mi. Die Elemente der Mi sind Basisdatentypen und beschreiben die Werte, die die Attribute annehmen können. \nDie Wertebereiche Mi heißen Domänen. Domänen sind atomar, d.h. keine zusammengesetzten Datentypen. Bei der Definition von Domänen muss angegeben werden, ob NULL-Werte, also einzelne Attribute ohne Werteintrag, zugelassen sind. Eine Domäne kann auch eine festgelegte\nMenge von Werten aus den obigen Basisdatentypen sein.", "type": "text", "answers": [{"text": "Das ist eine", "solution": "Domäne"}]}, {"id": 1127, "category": 8, "difficulty": 3, "text": "Woraus können Selektionsprädikate bestehen?", "explanation": "Bestandteile eines Selektionsprädikats sind: \n1. Attribute einer Relation und Konstanten als Operanden, \n2. Vergleichsoperatoren = <, ≤, >, ≥ , <> und != (ungleich), \n3. die logischen Operatoren UND, ODER und NICHT und \n4. Berechnungen mit Konstanten und Spaltenwerten (z.B. Gehalt*1,.045)  \n5. eine beliebige Kombination aus den oben genannten Möglichkeiten, die durch Klammerung (..) erzeugt wird.", "type": "multiple-choice", "answers": [{"text": "Konstanten", "solution": "true"}, {"text": "Join-Operatoren", "solution": "false"}, {"text": "Attributen", "solution": "true"}, {"text": "Vergleichsoperatoren", "solution": "true"}, {"text": "Domänen", "solution": "false"}]}, {"id": 1049, "category": 8, "difficulty": 3, "text": "Welche Operatoren der relationalen Algebra sind assoziativ?", "explanation": "Kartesisches Produkt, Vereinigung, Durchschnitt und Join-Operation sind assoziativ, d. h., Klammern können beliebig gesetzt werden.", "type": "multiple-choice", "answers": [{"text": "Projektion", "solution": "false"}, {"text": "Natural Join", "solution": "true"}, {"text": "kartesisches Produkt", "solution": "true"}, {"text": "Durchschnitt", "solution": "true"}, {"text": "Division", "solution": "false"}, {"text": "Differenz", "solution": "false"}, {"text": "Vereinigung", "solution": "true"}, {"text": "Join-Operatoren (Theta, Natural, Equi)", "solution": "true"}]}, {"id": 1331, "category": 8, "difficulty": 1, "text": "Wodurch wird in der relationalen Algebra der \"Für-Alle-Quantor\" (Allaussage) umgesetzt?", "explanation": "Mit der Division wird der All-Quantor dargestellt, zum Beispiel werden Anfragen der Gestalt \"Welche Lieferanten liefern alle Materialien?\" beantwortet.", "type": "multiple-choice", "answers": [{"text": "Division", "solution": "true"}, {"text": "Differenz", "solution": "false"}, {"text": "Durchschnitt", "solution": "false"}]}, {"id": 1488, "category": 8, "difficulty": 1, "text": "Welche Aussagen über die Join-Operation sind richtig?", "explanation": "In eine Join-Operation gehen nach Definition immer nur genau zwei Operatoren ein.", "type": "multiple-choice", "answers": [{"text": "Es ist eine unäre Operation.", "solution": "false"}, {"text": "Es ist eine binäre Operation.", "solution": "true"}, {"text": "Es ist eine ternäre Operation.", "solution": "false"}, {"text": "Es können beliebig viele Relationen in einer Join-Operation miteinander verknüpft werden.", "solution": "false"}]}, {"id": 556, "category": 8, "difficulty": 3, "text": "Wie heißt ein Natural Join, bei dem alle Tupel am Verbund der beiden Relationen teilnehmen?", "explanation": "Eine Join-Operation (Theta-Join, Equi-Join oder Natural-Join) zwischen R und S heißt verlustfrei, wenn alle Tupel von R und S am Verbund teilnehmen. Die inverse Operation Projektion erzeugt dann wieder R und S aus dem Join-Ergebnis.", "type": "text", "answers": [{"text": "Solch ein Join heißt", "solution": "verlustfrei"}]}, {"id": 559, "category": 8, "difficulty": 3, "text": "Welche der folgenden Operationen aus der relationalen Algebra sind kommutativ?", "explanation": "Während die beiden Mengenoperationen Vereinigung und Durchschnitt kommutativ sind, ist es die Differenz nicht, weil das Ergebnis davon abhängt, welche Relation von der anderen abgezogen wird. \nKartesisches Produkt und Join-Operation sind kommutativ (vertauschbar), das einzige, was sich ändert ist die Attributreihenfolge und das spielt keine Rolle.  \nHingegen sind die Left und Right Outer-Joins nicht kommutativ, da geht es ja gerade um die Anforderung, entweder die Tupel der linken oder rechten Relation vollständig in die Ergebnismenge aufzunehmen.", "type": "multiple-choice", "answers": [{"text": "Durchschnitt", "solution": "true"}, {"text": "Differenz", "solution": "false"}, {"text": "Union", "solution": "true"}, {"text": "Division", "solution": "false"}, {"text": "Kartesisches Produkt", "solution": "true"}, {"text": "Join-Operationen (Theta, Natural, Equi)", "solution": "true"}, {"text": "Outer Join-Operatoren (Left, Right)", "solution": "false"}]}, {"id": 569, "category": 8, "difficulty": 3, "text": "Welche Operationen der relationalen Algebra sind assoziativ?", "explanation": "Kartesisches Produkt, Union, Durchschnitt und Join-Operation sind assoziativ, d. h., Klammern können beliebig gesetzt werden.", "type": "multiple-choice", "answers": [{"text": "Projektion", "solution": "false"}, {"text": "Selektion", "solution": "false"}, {"text": "kartesisches Produkt", "solution": "true"}, {"text": "Differenz", "solution": "false"}, {"text": "Durchschnitt", "solution": "true"}, {"text": "Union", "solution": "true"}]}, {"id": 2489, "category": 8, "difficulty": 3, "text": "Welche der folgenden Operatoren der relationalen Algebra müssen der Anforderung genügen, \"vereinigungskonform\" zu sein?", "explanation": "Die Forderung in der Relationalen Algebra <a href =\"http://wikis.gm.fh-koeln.de/wiki_db/Datenbanken/Vereinigungskonform\"> vereinigungskonform  zu sein, gilt für alle drei Mengenoperatoren (Vereinigung, Differenz, Durchschnitt). \nDie beteiligten Relationen (Eingangsdatenmengen) müssen die gleichen Attributdefinitionen aufweisen: \nDie Anzahl der Attribute muss übereinstimmen. \nDie Attribute müssen gleich heißen.  \nDie Datentypen der der Attribute müssen gleich sein.  \nDie Reihenfolge der Attribute muss übereinstimmen. \nAchtung: In SQL wird diese Definition leicht variieren (keine gleichen Attributnamen).", "type": "multiple-choice", "answers": [{"text": "Projektion", "solution": "false"}, {"text": "Selektion", "solution": "false"}, {"text": "Kartesisches Produkt", "solution": "false"}, {"text": "Join (NATURAL, THETA, EQUI, )", "solution": "false"}, {"text": "OUTER JOIN (LEFT, RIGHT, FULL)", "solution": "false"}, {"text": "Vereinigung", "solution": "true"}, {"text": "Differenz", "solution": "true"}, {"text": "Durchschnitt", "solution": "true"}, {"text": "Division", "solution": "false"}, {"text": "Es gibt keine solche Anforderung in der RA.", "solution": "false"}]}, {"id": 2490, "category": 8, "difficulty": 3, "text": "Welche der folgende Aussagen über den Natural Join sind wahr?", "explanation": "Der Natural Join ist ableitbar aus dem kartesischen Produkt mit anschließender Selektion gemäss der implizit definierten Natural Join-Bedingung über alle Attribute, die gleichheißen, und abschließender Projektion, so dass die gleichheißenden Attribute nur einmal in der Ergebnismenge vorkommen. \nGrundoperatoren sind Operatoren, die nicht simuliert werden können und damit ist der Natural Join keiner.", "type": "multiple-choice", "answers": [{"text": "Für die Verknüpfungsbedingung werden nur die Fremd- und Primärschlüsselattribute, die gleich heißen, auf Gleichheit mit einander verglichen.", "solution": "false"}, {"text": "Die Attribute, die in beiden Relationen namensgleich vorkommen, treten in der Ergebnismenge nur einmal auf.", "solution": "true"}, {"text": "Er kann simuliert werden durch die RA-Operatoren kartesisches Produkt, Selektion, Projektion.", "solution": "true"}, {"text": "Er ist kein Grundoperator der relationalen Algebra.", "solution": "true"}]}, {"id": 468, "category": 8, "difficulty": 2, "text": "Welche der folgenden Aussagen über die relationale Algebra ist wahr?", "explanation": "Selektion ist die Auswahl von Tupeln und Projektion die Auswahl von Attributen. \nDie Ergebnismenge eines kartesischen Produkts angewendet auf zwei Relationen mit je n bzw. m Tupeln umfasst n x m Tupel. \nDie Division (Allaussage, Allquantor) könnte man zwar analog zu SQL mittels einer doppelten Differenz und vielen anderen Operatoren simulieren, aber als eine spezielle Form der Differenz kann sie wahrlich nicht bezeichnet werden. \nDie beiden Operatoren Selektion und der Projektion als Grundoperationen reichen nicht, um alle Operatoren der relationalen Algebra abzuleiten. Es fehlt u.a. ein so wichtiger Operator wie das Kartesische Produkt, dem einzigen Grundoperator, mit dem man die Tupel \"nebeneinander verknüpfen kann\".", "type": "multiple-choice", "answers": [{"text": "Selektion ist die Auswahl von Attributen und Projektion die Auswahl von Tupeln.", "solution": "false"}, {"text": "Die Ergebnismenge eines kartesischen Produkts angewendet auf zwei Relationen mit je n bzw. m Tupeln umfasst n x m Tupel.", "solution": "true"}, {"text": "Die Division ist eine spezielle Form der Differenz.", "solution": "false"}, {"text": "Alle Operatoren der relationalen Algebra lassen sich aus der Selektion und der Projektion als Grundoperationen ableiten.", "solution": "false"}]}, {"id": 469, "category": 8, "difficulty": 2, "text": "Betrachten Sie zwei Relationen Artikel(ArtikelNr, Bezeichnung...)und Auftragspositionen (AuftragsNr, ArtikelNr, Menge...). Die Relation Auftragspositionen enthält einen Fremdschlüssel zu dem Attribut ArtikelNr in der Relation Artikel. Die Relation Artikel soll jetzt nur noch Einträge enthalten, die auch wenigstens einmal gekauft wurden. Kann man das Problem lösen, indem man ArtikelNr in ARTIKEL als zusätzlichen Fremdschlüssel deklariert, der auf das Attribut ArtikelNr in der Relation Auftragspositionen referenziert?", "explanation": "An dieser Stelle lösen Fremdschlüssel, die man in beiden Richtungen vereinbaren kann, nicht das Problem, da sie sich gegenseitig behindern und so das Einfügen von Daten generell verhindern würden. Denkbar sind allerdings Datenbanktrigger zur Lösung dieses Problems.", "type": "multiple-choice", "answers": [{"text": "Nein. Das wäre kein gültiger Fremdschlüssel.", "solution": "false"}, {"text": "Man kann den Fremdschlüssel deklarieren, aber er würde das Problem nicht lösen.", "solution": "true"}, {"text": "Ja", "solution": "false"}]}, {"id": 1032, "category": 8, "difficulty": 3, "text": "Was versteht man unter \"Dangling Tuples\" in der relationalen Algebra?", "explanation": "Gibt es Tupel in einer Relation, deren Werte in den Fremdschlüssel-Attributen auf Werte in der anderen Relation verweisen, die dort nicht (mehr) existieren, so sind dies die sog. \"dangling tuples\", die Probleme hinsichtlich der referenziellen Integrität darstellen. \nEbenso werden auch Tupel, die bei Join-Operationen nicht mit entsprechenden Tupeln aus der anderen Relation verknüpft werden können, als \"dangling tuples\" bezeichnet.", "type": "multiple-choice", "answers": [{"text": "Tupel, die nicht gesichert werden.", "solution": "false"}, {"text": "Tupel, denen bei Join-Operationen die entsprechenden Tupel in der anderen Relation fehlen, mit denen sie verknüpft werden könnten.", "solution": "true"}, {"text": "Tupel, denen Attributwerte fehlen.", "solution": "false"}, {"text": "Tupel in einer Relation, deren Werte in den Fremdschlüssel-Attributen auf Werte in der anderen Relation verweisen, die dort nicht (mehr) existieren.", "solution": "true"}]}, {"id": 639, "category": 8, "difficulty": 1, "text": "In der relationalen Algebra sind Null-Werte für Attribute nicht zulässig.", "explanation": "In der relationalen Algebra sind Null-Werte für Attribute zugelassen.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "false"}, {"text": "stimmt nicht", "solution": "true"}]}, {"id": 759, "category": 8, "difficulty": 3, "text": "Wie viele Tupel hat die Ergebnismenge des kartesischen Produkts von zwei Relationen, die 18 bzw. 20 Tupel beinhalten, wobei es für 14 Tupel der einen Relation Tupel der anderen Relation gibt, die in einem gleichheißenden Attribut die gleichen Werte aufweisen?", "explanation": "Das Kartesische Produkt \"verbindet jedes Tupel der einen Relation mit jedem Tupel aus der anderen Relation unabhängig von irgendwelchen passenden oder nichtpassenden Werten\" und somit ergeben sich 18*20 = 360 Tupel in der Ergebnismenge. \nDas nur bei 14 Tupeln übereinstimmende Werte gegeben sind, spielt für das kartesische Produkt keine Rolle, sondern nur für den Natural Join.", "type": "text", "answers": [{"text": "Das kartesische Produkt hat ... Tupel.", "solution": "360"}]}, {"id": 760, "category": 8, "difficulty": 1, "text": "Jede n-stellige Relation R ist eine Teilmenge des kartesischen Produkts der Wertebereiche der Attribute.", "explanation": "Sei (A1,..., An) eine Menge von Attributen mit den Wertebereichen Mi. Die Elemente der Mi sind Basisdatentypen und beschreiben die Werte, die die Attribute annehmen können. Eine n-stellige Relation R ist eine Teilmenge des kartesischen Produkts M1×...×Mn. Rn bezeichne die Menge aller n-stelligen Relationen. Man schreibt auch: R(A1,...,An).", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "true"}, {"text": "stimmt nicht", "solution": "false"}]}, {"id": 763, "category": 8, "difficulty": 2, "text": "Relationale Operatoren sind immer Abbildungen, die zwei Relationen eine Ergebnis-Relation zuordnen.", "explanation": "Unär:  F1 : Rn → Rm      mit n , m ∈ N \nBinär: F2 : Rn × Rm → Rk mit n , m , k ∈ N\nUnäre Operatoren: Selektion, Projektion\nBinäre Operatoren: Kartesisches Produkt, alle Join-Operatoren, alle Mengenoperatoren, Division", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "false"}, {"text": "stimmt nicht", "solution": "true"}]}, {"id": 786, "category": 8, "difficulty": 2, "text": "Mit welchem Operator der relationalen Algebra wird der Für-Alle-Quantor (die Allaussage) umgesetzt?", "explanation": "Mit der Division wird der All-Quantor dargestellt, zum Beispiel werden Anfragen der Gestalt \"Welche Lieferanten liefern alle Materialien?\" beantwortet.", "type": "text", "answers": [{"text": "Der Operator heißt", "solution": "Division"}]}, {"id": 1270, "category": 8, "difficulty": 2, "text": "Relationale Operatoren sind immer Abbildungen, die aus einer Relation eine Ergebnis-Relation erzeugen.", "explanation": "Neben den unären (Selektion, Projektion) gibt es aber auch noch die binären Operatoren (kartesisches Produkt, Joins, Mengenoperatoren, Division). \nDurch Anwendung einer dieser Operationen entsteht aus einer oder zwei Relationen wieder eine neue Relation. \nF1 : Rn -> Rm mit n , m ∈ N \nF2 : Rn × Rm -> Rk mit n , m , k ∈ N", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "false"}, {"text": "stimmt nicht", "solution": "true"}]}, {"id": 1585, "category": 7, "difficulty": 1, "text": "Eine Relation in der zweiten Normalform mit zwei Attributen ist auch immer in der dritten Normalform.", "explanation": "Ja, denn für die Verletzung der 3. NF werden wenigstens drei Attribute benötigt, je eines für X,Y und Z. \nEine Relation R ist in der dritten Normalform (3NF), wenn sie sich in der ersten und der zweiten Normalform befindet und kein Nichtschlüsselattribut transitiv abhängig von einem Schlüsselattribut ist. \nMit X, Y und Z seien paarweise verschiedene Attributkombinationen einer Relation R = R(A1, A2,...,An) bezeichnet. \nZ heißt transitiv abhängig von X, wenn Y voll funktional abhängig von X und Z voll funktional abhängig von Y ist, aber X nicht voll funktional abhängig von Y ist. \nAlso X →Y →Z, aber nicht Y →X.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "true"}, {"text": "stimmt nicht", "solution": "false"}]}, {"id": 1587, "category": 7, "difficulty": 2, "text": "Eine Relation in der zweiten Normalform mit nur zwei funktionalen\nAbhängigkeiten ist immer in der dritten Normalform.", "explanation": "Mit nur einer funktionalen Abhängigkeit, wäre keine Möglichkeit zur Transitivitiät gegeben. z.B. a->b,c. \nAber mit zwei funktionalen Abhängigkeiten ist als Mindestvoraussetzung grundsätzlich die Möglichkeit gegeben, dass es sich dabei um transitive Abhängigkeiten handeln könnte. z.B. a->b,c. und b->c.", "type": "multiple-choice", "answers": [{"text": "Dieser Sachverhalt spielt in diesem Zusammenhang keine Rolle.", "solution": "false"}, {"text": "stimmt", "solution": "false"}, {"text": "stimmt nicht", "solution": "true"}]}, {"id": 1604, "category": 7, "difficulty": 1, "text": "Eine Relation in der zweiten Normalform, in der keine transitiven Abhängigkeiten auftreten, ist immer in der dritten Normalform.", "explanation": "Eine Relation R ist in der ersten Normalform (1NF), wenn alle Attribute nur atomare Werte (keine mengenwertigen Datentypen) enthalten.  \nEine Relation R mit Primärschlüssel S befindet sich in der zweiten Normalform (2NF), wenn sie (1NF) ist und jedes Nichtschlüsselattribut voll funktional abhängig vom Primärschlüssel S ist.  \nEine Relation R ist in der dritten Normalform (3NF), wenn sie sich in der ersten und der zweiten Normalform befindet und kein Nichtschlüsselattribut transitiv abhängig von einem Schlüsselattribut ist.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "true"}, {"text": "stimmt nicht", "solution": "false"}]}, {"id": 561, "category": 7, "difficulty": 2, "text": "Welche Integritätsarten gibt es in relationalen Datenbanksystemen/im relationalen Modell?", "explanation": "Eine Menge von Relationen R1,...,Rk besitzt die referentielle Integrität, wenn jeder Wert eines Fremdschlüssels einer Relation Ri Wert eines Primärschlüssels in einer anderen Relation Rj\nist. Handelt es sich bei den Relationen Ri und Rj um die gleiche Relation, so wird diese Form der Referenz Selbstreferenz oder auch rekursive Referenz genannt. \nEine Menge von Relationen R1,...,Rk besitzt die Entity-Integrität, wenn jede Relation einen Primärschlüssel besitzt. \nEine Menge von Relationen R1,...,Rk besitzt die semantische Integrität, wenn die Korrektheit der Eingaben der Benutzer gewährleistet ist. \nDie ürbrigen Integritätsbegriffe gibt es nicht in diesem Zusammenhang.", "type": "multiple-choice", "answers": [{"text": "Entity-Integrität", "solution": "true"}, {"text": "referentielle Integrität", "solution": "true"}, {"text": "semantische Integrität", "solution": "true"}, {"text": "differenzielle Integrität", "solution": "false"}, {"text": "divergente Integrität", "solution": "false"}, {"text": "resorbierende Integrität", "solution": "false"}]}, {"id": 682, "category": 7, "difficulty": 1, "text": "Bei welchem Beziehungstyp eines ER-Diagramms entsteht bei der Abbildung auf ein relationales Datenbankschema immer eine neue Relation?", "explanation": "Für n:m, cn:m, n:cm, cn:cm-Beziehungen im ERD gilt: \nFür beide (bzw. drei bei einer ternären Beziehung) Entity-Mengen und die Beziehung werden je eine Relation mit entsprechenden verbindenden Beziehungen erzeugt.", "type": "multiple-choice", "answers": [{"text": "1:1-Beziehung", "solution": "false"}, {"text": "1:n-Beziehung", "solution": "false"}, {"text": "n:m-Beziehung", "solution": "true"}]}, {"id": 1294, "category": 7, "difficulty": 3, "text": "Welche Aussagen über Normalformen sind wahr?", "explanation": "In der 3. NF sind partielle (2.NF) und transitive funktionale Abhängigkeiten (3. NF) aufgelöst, so dass jedes Nichtschlüsselattribut nur einmal auftritt in allen Relationen. Lediglich Schlüsselattribute der einen Relation können in anderen Relationen als Fremdschschlüssel-Attribute auftreten, somit liegen nur noch in diesen Fremdschlüsselattributen Redundanzen vor. \nFalsch ist \"Redundanzen vermeiden Einfüge-/Lösch- und Änderungsanomalien.\", weil Redundanzen Grundvoraussetzungen für diese Anomalien sind. \nFalsch ist \"Eine Relation R mit Primärschlüssel S befindet sich in der ersten Normalform, wenn jedes Nichtschlüsselattribut voll funktional abhängig vom Primärschlüssel S ist.\", weil dies die Definition der 2. NF ist. Die 1. NF schließt mengenwertige (nicht atomare) Attribute aus. \nEine Relation ist in der dritten Normalform, wenn sie in der 1. und 2. NF ist und kein Nichtschlüsselattribut transitiv abhängig ist von einem Schlüsselattribut.", "type": "multiple-choice", "answers": [{"text": "Ein Datenmodell in 3. Normalform enthält keine Redundanzen außer Schlüsselredundanzen (Fremdschlüsselbeziehungen).", "solution": "true"}, {"text": "Redundanzen vermeiden Einfüge-/Lösch- und Änderungsanomalien.", "solution": "false"}, {"text": "Eine Relation R mit Primärschlüssel S befindet sich in der ersten Normalform, wenn jedes Nichtschlüsselattribut voll funktional abhängig vom Primärschlüssel S ist.", "solution": "false"}, {"text": "Eine Relation ist in der dritten Normalform, wenn sie in der 1. und 2. NF ist und kein Nichtschlüsselattribut transitiv abhängig ist von einem Schlüsselattribut.", "solution": "true"}]}, {"id": 586, "category": 7, "difficulty": 2, "text": "Attribute in der ersten Normalform dürfen Wiederholungsgruppen von Attributen haben.", "explanation": "Eine Relation R ist in der ersten Normalform (1NF), wenn alle Attribute nur atomare Werte (keine mengenwertigen Datentypen) enthalten.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "false"}, {"text": "stimmt nicht", "solution": "true"}]}, {"id": 571, "category": 7, "difficulty": 2, "text": "Jedes Nicht-Schlüssel-Attribut ist in einer Relation R voll funktional abhängig vom Primärschlüssel S.", "explanation": "Eine Relation R ist in der ersten Normalform (1NF), wenn alle Attribute nur atomare Werte (keine mengenwertigen Datentypen) enthalten.  \nEine Relation R mit Primärschlüssel S befindet sich in der zweiten Normalform (2NF), wenn sie (1NF) ist und jedes Nichtschlüsselattribut voll funktional abhängig vom Primärschlüssel S ist.  \nEine Relation R ist in der dritten Normalform (3NF), wenn sie sich in der ersten und der zweiten Normalform befindet und kein Nichtschlüsselattribut transitiv abhängig von einem Schlüsselattribut ist.", "type": "multiple-choice", "answers": [{"text": "Das ist die erste Normalform.", "solution": "false"}, {"text": "Das ist die zweite Normalform.", "solution": "true"}, {"text": "Das ist die dritte Normalform.", "solution": "false"}, {"text": "Das entspricht keiner Normalform.", "solution": "false"}]}, {"id": 3781, "category": 7, "difficulty": 1, "text": "Betrachten Sie eine RelationR(A, B, C, D, E, F) mit den funktionalen Abhängigkeiten (FD):  A-> B, C, E     C -> E  und   D -> F , sowie dem Primäraschlüssel AD.  Welche davon sind bezogen auf den gefundenen Primärschlüssel partielle FDs?", "explanation": "A und D gehören zum Primärschlüssel.", "type": "multiple-choice", "answers": [{"text": "Es gibt keine", "solution": "false"}, {"text": "A -> B, C, E", "solution": "true"}, {"text": "C -> E", "solution": "false"}, {"text": "D-> F", "solution": "false"}]}, {"id": 3780, "category": 7, "difficulty": 1, "text": "Betrachten Sie eine RelationR(A, B, C, D, E, F) mit den funktionalen Abhängigkeiten (FD):  A-> B, C, E     C -> E  und   D -> F , sowie dem Primäraschlüssel AD.  Welche davon sind bezogen auf den gefundenen Primärschlüssel transitive FDs?", "explanation": "C gehört nicht zum Primärschlüssel.", "type": "multiple-choice", "answers": [{"text": "Es gibt keine", "solution": "false"}, {"text": "A -> B, C, E", "solution": "false"}, {"text": "C -> E", "solution": "true"}, {"text": "D-> F", "solution": "false"}]}, {"id": 584, "category": 7, "difficulty": 1, "text": "In einer Relation sei kein Sekundärattribut (Nicht-Schlüsselattribut) transitiv abhängig von einem Schlüsselattribut.", "explanation": "Eine Relation R ist in der ersten Normalform (1NF), wenn alle Attribute nur atomare Werte (keine mengenwertigen Datentypen) enthalten.  \nEine Relation R mit Primärschlüssel S befindet sich in der zweiten Normalform (2NF), wenn sie (1NF) ist und jedes Nichtschlüsselattribut voll funktional abhängig vom Primärschlüssel S ist.  \nEine Relation R ist in der dritten Normalform (3NF), wenn sie sich in der ersten und der zweiten Normalform befindet und kein Nichtschlüsselattribut transitiv abhängig von einem Schlüsselattribut ist.", "type": "multiple-choice", "answers": [{"text": "Das ist die dritte Normalform.", "solution": "true"}, {"text": "Das ist die erste Normalform.", "solution": "false"}, {"text": "Das ist die zweite Normalform.", "solution": "false"}]}, {"id": 644, "category": 7, "difficulty": 3, "text": "Jeder Wert eines Fremdschlüssels einer Relation A ist Wert eines Primärschlüssel in einer anderen Relation. Diese Eigenschaft heißt", "explanation": "Eine Menge von Relationen R1,...,Rk besitzt die referentielle Integrität, wenn jeder Wert eines Fremdschlüssels einer Relation Ri Wert eines Primärschlüssels in einer anderen Relation Rj ist. Handelt es sich bei den Relationen Ri und Rj um die gleiche Relation, so wird diese Form der Referenz Selbstreferenz oder auch rekursive Referenz genannt.", "type": "text", "answers": [{"text": "Diese Integrität heißt:", "solution": "referentielle Integrität"}]}, {"id": 1788, "category": 7, "difficulty": 1, "text": "Eine Relation in der ersten Normalform mit nur einem Primärschlüsselattribut ist automatisch in der zweiten Normalform.", "explanation": "Das Gegebensein der 1. NF ist Grundvoraussetzung für die 2. NF. \nWenn ein Primärschlüssel nur aus Attribut besteht, dann sind alle abhängigen Attribute zwingend voll funktional abhängig. Partiell abhängig hieße ja, dass Nichtschlüsselattribute nur von einer Teilmenge der Attribute abhängig wären, was bei nur einem Attribut des Primärschlüssels nicht geht.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "true"}, {"text": "stimmt nicht", "solution": "false"}]}, {"id": 1798, "category": 7, "difficulty": 1, "text": "Welche Aussagen über Normalformen sind wahr?", "explanation": "Richtig ist: \"Jede 1NF-Relation mit einem Primärschlüssel, der aus einem einzigen Attribut besteht, ist immer automatisch auch 2NF.\" \nWenn ein Primärschlüssel nur aus einem Attribut besteht, wie soll es da eine partielle Abhängigkeit geben? Partielle heißt ja, dass einige Nichtschlüsselattribute nur von Teilen des Primärschlüssels abhängig sind, was bei einem Schlüssel mit nur einen Attribut ja ausgeschlossen ist. \nFalsch ist: \"Jede 1NF-Relation mit einem Primärschlüssel, der aus einem einzigen Attribut besteht, ist immer automatisch auch 3NF.\"\nGegenbeispiel: A->B,C und B->C und einer Relation R(A (PK),B,C).\n\nFalsch ist: \"Bei der Überführung in die dritte Normalform sind die vorher zu erstellende 2NF-Relationen immer von den endgültigen 3NF-Relationen verschieden.\" \nWenn es keine transitiven Abhängigkeiten gibt, dann gilt: 2. NF = 3. NF und damit sind die Relationen gleich in beiden NFs.", "type": "multiple-choice", "answers": [{"text": "Jede 1NF-Relation mit einem Primärschlüssel, der aus einem einzigen Attribut besteht, ist immer automatisch auch 2NF.", "solution": "true"}, {"text": "Jede 1NF-Relation mit einem Primärschlüssel, der aus einem einzigen Attribut besteht, ist immer automatisch auch 3NF.", "solution": "false"}, {"text": "Bei der Überführung in die dritte Normalform sind die vorher zu erstellende 2NF-Relationen immer von den endgültigen 3NF-Relationen verschieden.", "solution": "false"}]}, {"id": 2900, "category": 7, "difficulty": 2, "text": "Welche Normalform reduziert die Redundanz in einer relationalen Datenbank?", "explanation": "Die Überführung einer Relation in die 1NF erhöht in der Regel die Redundanz, bei der 2NF und der 3NF ist es umgekehrt.", "type": "multiple-choice", "answers": [{"text": "3NF", "solution": "true"}, {"text": "Jede der drei Normalfomen (1NF, 2NF und 3NF)", "solution": "false"}, {"text": "1NF", "solution": "false"}, {"text": "2NF", "solution": "true"}]}, {"id": 2800, "category": 7, "difficulty": 1, "text": "Betrachten Sie eine Relation in der 2NF, die außer Primärschlüsselattributen nur ein einziges Nichtschlüsselattribut besitzt. Solch eine Relation ist immer automatisch in der 3NF.", "explanation": "Eine Relation, die nur ein Nichtschlüsselattribute hat, kann nie transitive Abhängigkeiten (siehe <a href =\"http://wikis.gm.fh-koeln.de/wiki_db/Datenbanken/Transitive-Abhaengigkeit/\">DB-Wiki ) aufweisen.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "true"}, {"text": "stimmt nicht", "solution": "false"}]}, {"id": 2797, "category": 7, "difficulty": 3, "text": "Betrachten Sie eine Relation R(A, B, C, D, E, F) mit dem Primärschlüssel A, C und den folgenden funktionalen Abhängigkeiten Welche Arten funktionaler Abhängigkeiten liegen hier vor? Es ist ausreichend, wenn Sie nur die Eigenschaft \"XXX\" der funktionalen Abhängigkeit als Antwort eintragen, also volle, partielle oder transitive.", "explanation": "B, D, E, F sind voll funktional vom gesamten Primärschlüssel A,C abhängig.\n\n    F ist von B abhängig und B von A,C und damit ist F transitiv von A,C abhängig.\n\n    E ist von D abhängig und D von A,C und damit ist E transitiv von A,C abhängig.", "type": "text", "answers": [{"text": "A, C -> B, D, E, F", "solution": "volle"}, {"text": "D -> E", "solution": "transitive"}, {"text": "B -> F", "solution": "transitive"}]}, {"id": 2899, "category": 7, "difficulty": 2, "text": "Jede Überführung in eine Normalform (1NF, 2NF odr 3NF) verringert Redundanz in der Datenbank.", "explanation": "Die Überführung einer Relation in die 1NF erhöht in der Regel die Redundanz.", "type": "multiple-choice", "answers": [{"text": "stimmt", "solution": "false"}, {"text": "stimmt nicht", "solution": "true"}]}, {"id": 2462, "category": 9, "difficulty": 3, "text": "Welche SQL-Constraints bieten die Möglichkeit zur Fehlerkorrektur?", "explanation": "Das \"Normalverhalten\" bei einem Integritätsfehler in SQL ist, dass dieser Fehler angezeigt wird und bei einer IMMEDIATE-Prüfung die Datenmanipulation abgebrochen wird bzw. bei einer DEFERRED-Prüfung die ganze Transaktion zurückgerollt wird. Dieses Verhalten wird für Integritätsfehler ausschließlich bei NOT NULL, PRIMARY KEY, UNIQUE ausgeführt. \n\nLediglich die Fremdschlüssel-Constraints bieten neben diesem \"Normalverhalten\" eine Option zur Fehlerkorrektur und zwar unabhängig davon, ob als Spalten- oder Tabellen-Constraint definiert. Die Fehlerkorrekturen betrifft die sog. \"Dangling Tuples\"-Problematik,wenn Masterdatensätze gelöscht werden, für die noch abhängige Detail-Datensätze bestehen. Es besteht dann die Möglichkeit, z.B. die abhängigen Detaildatensätze ebenfalls zu löschen (CASCADE) oder deren Fremdschlüsselwert auf einen vorgegebenen Wert bzw. auf NULL zu setzen (DEFAULT/NULL)... \n\n ::=\nREFERENCES Tabellenname [ ( Spaltenname [ , Spaltenname ]... ) ] \n\n[ <Fehlerkorrektur Definition> ]\n\n<Fehlerkorrektur Definition> ::=\nON UPDATE <Fehlerkorrektur Aktion>\n| ON DELETE <Fehlerkorrektur Aktion>\n<Fehlerkorrektur Aktion> ::=\nCASCADE | SET NULL | SET DEFAULT | RESTRICT | NO ACTION", "type": "multiple-choice", "answers": [{"text": "CHECK (Bedingung)", "solution": "false"}, {"text": "PRIMARY KEY", "solution": "false"}, {"text": "FOREIGN KEY", "solution": "true"}, {"text": "NOT NULL", "solution": "false"}, {"text": "UNIQUE", "solution": "false"}]}, {"id": 1376, "category": 9, "difficulty": 3, "text": "Welche Aussagen über CONSTRAINTS sind wahr?", "explanation": "Die zwei richtigen Aussagen erklären sich selbst. \nFALSCH ist: \nDie Sache mit dem \"MANDATORY-CONSTRAINT\". Ein Constraint dieses Namens gibt es nicht. Das Constraint mit der gewünschten Funktion heißt: NOT NULL bei SQL.", "type": "multiple-choice", "answers": [{"text": "Für im ER-Modell als \"obligatorisch\" (Pflichteingabe) deklarierte Attribute werden im Datenmodell MANDATORY-CONSTRAINTS definiert.", "solution": "false"}, {"text": "Die Standardreaktion auf einen Integritätsfehler beim \"integrity checking\" mittels Constraints ist das Zurückrollen des fehlerhaften DML-Befehls (Prüfungsmodus IMMEDIATE) bzw. der gesamten Transaktion beim Prüfungsmodus DEFERRED.", "solution": "true"}, {"text": "Transitionale Integritätsbedingungen können in SQL nicht als CONSTRAINT definiert werden, wohl aber mittels der Referenzvariablen (:OLD.spaltenname, :NEW.spaltenname) in ROW-Triggern.", "solution": "true"}]}, {"id": 2106, "category": 9, "difficulty": 2, "text": "Was versteht man unter \"Dangling-Datensätzen\" in SQL?", "explanation": "Werden Fremdschlüssel verwendet, so kann es zur sog. \"Dangling Tuples\"-Problematik kommen, bei der es darum geht, dass Master-Datensätze, die noch von Detail-Datensätze referenziert werden, gelöscht oder deren Schlüsselwert geändert wird und das anschließend Detail-Datensätze existieren, für deren Fremdschlüsselwerte es dann keinen passenden Datensatz in der Master-Tabelle mehr gibt. \nDas Einfügen von Master-Datensätzen ist immer unproblematisch, da eine Fremdschlüsselbedingung es zuläßt, dass es Master-Datensätze gibt, für die es keine Detail-Datensätze gibt. \n\nAnaloge Probleme können bei Join-Operationen (Theta, Equi, Natural) auftreten. In die Ergebnismenge werden nur die Datensätze aufgenommen, die die Verknüpfungsbedingung erfüllen. Alle anderen fallen heraus, das sind die sog. \"dangling tuples\". Will man diese auch anzeigen lassen, muss man mit LEFT/RIGHT/FULL OUTER JOINs arbeiten.", "type": "multiple-choice", "answers": [{"text": "Datensätze, die nicht gesichert werden.", "solution": "false"}, {"text": "Datensätze, denen bei Join-Operationen bzw. bei Fremdschlüsselbeziehungen die entsprechenden Datensätze in der anderen Tabelle fehlen, mit denen sie verknüpft werden können.", "solution": "true"}, {"text": "Datensätze, denen Attributwerte fehlen.", "solution": "false"}, {"text": "Geänderte Datensätze, deren Transaktion noch nicht abgeschlossen ist.", "solution": "false"}]}, {"id": 2073, "category": 9, "difficulty": 1, "text": "Welcher Join-Tabellen-Typ hat eine ON-Klausel?", "explanation": "Beim CROSS JOIN, dem kartesischen Produkt, gibt es gar keine Verknüpfungsbedingung. Jeder Datensatz der einen Relation wird \"grundlos\" mit jedem anderen aus der anderen Relation verknüpft.\nBeim NATURAL JOIN gibt es zwar eine Bedingung, aber die ist vordefiniert, so dass sie nicht mittels USING spezifiziert werden muss. Die vordefinierte Bedingung heißt: Alle Spalten mit gleichen Namen werden auf Gleichheit verglichen und die Teilbedingungen ggf. mit AND verknüpft.\nLediglich beim THETA JOIN wird eine Bedingung angegeben.", "type": "multiple-choice", "answers": [{"text": "CROSS-Join", "solution": "false"}, {"text": "THETA-Join", "solution": "true"}, {"text": "NATURAL-Join", "solution": "false"}]}, {"id": 2702, "category": 9, "difficulty": 3, "text": "Unter welchen Voraussetzungen kann bei der Programmierung von SELECT INTO-Anweisungen auf die eine oder andere EXCEPTION, die üblicherweise immer im Zusammenhang mit SELECT-INTOs zu programmieren sind, ganz sicher verzichtet werden?", "explanation": "SELECT INTO übergibt genau einen Datensatz oder Wert an die INTO-Variable, die nur genau einen Wert oder Datensatz aufnehmen kann. Mehrere bzw. keine Datensätze als Ergebnis des SELECTS werfen die Exception TOO_MANY_ROWS bzw. NO_DATA_FOUND, wenn das Resultat des SELECTS leer ist. Eine Alternative ist die Verwendung eines Cursors, der auch mehrere Datensätze verarbeiten kann.\n\n    \n\n    Es reicht nicht aus, wenn in Tabellen Datensätze vorhanden sind. Relevant ist, dass immer wdenigstens ein Datensatz gefunden wird, um auf die NO_DATA_FOUND verzichten zu können.\n\n    \n\n    Werden Anfragen über Primär- oder Eindeutigkeitsschlüssel an eine einzige Tabelle formuliert, steht fest, dass es keine TOO_MANY_ROWS geben kann.\n\n    \n\n    Werden Anfragen über Primär- oder Eindeutigkeitsschlüssel an die Detail-Tabelle von Joins formuliert, die mittels Fremdschlüsseln verknpüft sind, so steht fest, dass es keine TOO_MANY_ROWS geben kann.\n\n    \n\n    Aggregatfunktionen haben die Eigenschaft, dass sie je Gruppe nur einen Ergenbisdatensatz liefern. Steht also zwingend fest, dass es nur eine Gruppe gibt - z.B. bei fehlender Gruppierung nur über die GEsamtmenge - dann kann auch auf die TOO_MANY_ROWS verzichtet werden.", "type": "multiple-choice", "answers": [{"text": "Wenigstens eine der beteiligten Tabellen enthält Datensätze.", "solution": "false"}, {"text": "Die Anfrage liefert immer wenigstens einen Datensatz.", "solution": "true"}, {"text": "Es wird bei Anfragen ohne JOINs in der WHERE-Klausel über die Primärschlüssel der beteiligten Tabelle zugegriffen.", "solution": "true"}, {"text": "Es wird bei Anfragen mit JOINs in der WHERE-Klausel über die Fremdschlüssel verknüpft und über die Primärschlüssel bei den Detail-Tabellen eingeschränkt.", "solution": "true"}, {"text": "Es wird bei Anfragen ohne JOINs in der WHERE-Klausel über die UNIQUE-Schlüssel der beteiligten Tabelle zugegriffen.", "solution": "true"}, {"text": "Alle beteiligten Tabellen enthalten Datensätze.", "solution": "false"}, {"text": "Es wird bei Anfragen mit JOINs in der WHERE-Klausel über die Fremdschlüssel verknüpft und über die UNIQUE-Schlüssel der Detail-Tabellen eingeschränkt.", "solution": "true"}, {"text": "Wenn in der SELECT-Klausel Aggregatfunktionen ohne Gruppierung verwendet werden.", "solution": "true"}, {"text": "Wenn in der SELECT-Klausel Aggregatfunktionen verwendet werden.", "solution": "false"}]}, {"id": 1301, "category": 11, "difficulty": 3, "text": "Welche Aussagen über \"Transaktionen und Mehrbenutzerbetrieb in SQL\" sind richtig?", "explanation": "FALSCH ist:  \n\"Non repeatable read\" und \"phantome\" sind zwei eng verwandte Probleme. Bei beiden geht es darum, dass die eine Anwendung die gleiche Anfrage in mindestens zwei verschiedenen Transaktionen ausführt und dann ggf. auf unterschiedlichen Datenbankzuständen ausführt, weil eine andere Transaktion Datensätze eingefügt oder geändert hat.\"  \nDie Aussage ist richtig bis auf den Teil: \"...gleiche Anfrage in mindestens zwei verschiedenen Transaktionen ausführt...\" Ganz:-) richtig wird die Aussage, wenn man das \"zwei verschiedene Transaktionen\" durch \"eine Transaktion\" ersetzt.\n  \n\nRICHTIG sind die anderen beiden Aussagen.", "type": "multiple-choice", "answers": [{"text": "\"Non repeatable read\" und \"phantome\" sind zwei eng verwandte Probleme. Bei beiden geht es darum, dass die eine Anwendung die gleiche Anfrage in mindestens zwei verschiedenen Transaktionen ausführt und dann ggf. auf unterschiedlichen Datenbankzuständen ausführt, weil eine andere Transaktion Datensätze eingefügt oder geändert hat.", "solution": "false"}, {"text": "\"Dirty reads\" treten auf, wenn eine z.B. Transaktion T1 Datensätze liest und verarbeitet, die eine andere Transaktion T2 zwar geändert aber nicht \"committet\" hat und T2 später mit einem Rollback abgeschlossen wird.", "solution": "true"}, {"text": "Beim \"lost update\"-Problem lesen zwei Transaktionen T1 und T2 die gleichen Daten. Dann verarbeitet und speichert z.B. T2 die gelesenen Daten. T1 verarbeitet und speichert die Daten erst nach T2 ab und überschreibt somit die Änderungen von T2 ungesehen.", "solution": "true"}]}, {"id": 1595, "category": 11, "difficulty": 2, "text": "Welche Aussagen über \"Transaktionen und Mehrbenutzerbetrieb in SQL\" sind richtig?", "explanation": "Alle drei Antworten sind richtig.", "type": "multiple-choice", "answers": [{"text": "Solange eine Transaktion einen Datensatz oder eine Tabelle mit \"SLOCK\" gesperrt hat, können andere Transaktion keine XLOCKs auf das gesperrte Objekt absetzen.", "solution": "true"}, {"text": "Beim \"pessimistischen\" LOCK-Verfahren lösen auch lesende Zugriffe Sperren für andere Benutzer aus. Die Daten werden erst wieder freigegeben, wenn alle Änderungen gespeichert sind. Nachteil des pessimistischen Verfahrens ist, dass andere Transaktionen oft unnötig lange auf die Freigabe von Daten warten müssen. Das parallele Arbeiten vieler Benutzer kann dadurch sehr eingeschränkt sein.", "solution": "true"}, {"text": "Beim \"optimistischen\" LOCK-Verfahren lösen lesende Zugriffe keine Sperren aus. Jede Tabelle verfügt über einen Zeitstempel, der den Zeitpunkt der letzten Änderung angibt. Bei Datenänderungen wird zunächst geprüft, der Zeitstempel der Tabelle noch der gleiche ist wie beim Lesen der Daten. Ist dies der Fall, dann sind die Daten der Tabelle seit dem Lesen unverändert und die Änderungen können gespeichert werden.", "solution": "true"}]}, {"id": 1112, "category": 11, "difficulty": 1, "text": "Welche Aussagen über Transaktionen und Integritätsprüfung in SQL sind richtig?", "explanation": "RICHTIG sind:\n\"IMMEDIATE bezeichnet die Integritätsprüfung unmittelbar im Anschluss an die Ausführung des DML-Befehls und DEFERRED erst zum Transaktionsende.\"\n\n\"In SQL gibt es 5 CONSTRAINTs mittels denen die Datenintegrität gesichert werden kann: [NOT] NULL, PRIMARY KEY, UNIQUE KEY, FOREIGN KEY, CHECK.\"\n\nFALSCH sind: \n\"Wird vom DBMS ein Fehler bei der IMMEDIATE-Integritätsprüfung erkannt, so wird die gesamte Transaktion zurückgerollt.\" Bei einem IMMEDIATE-Fehler wird nur die eine fehlerhafte DML-Anweisung rückgängig gemacht. \n\n\"Wird vom DBMS ein Fehler bei der DEFERRED-Integritätsprüfung erkannt, so wird nur der fehlerhafte DML-Befehl zurückgerollt.\" Bei einem DEFERRED-Fehler wird die gesamte Transaktion zurückgerollt.", "type": "multiple-choice", "answers": [{"text": "Wird vom DBMS ein Fehler bei der IMMEDIATE-Integritätsprüfung erkannt, so wird die gesamte Transaktion zurückgerollt.", "solution": "false"}, {"text": "Wird vom DBMS ein Fehler bei der DEFERRED-Integritätsprüfung erkannt, so wird nur der fehlerhafte DML-Befehl zurückgerollt.", "solution": "false"}, {"text": "IMMEDIATE bezeichnet die Integritätsprüfung unmittelbar im Anschluss an die Ausführung des DML-Befehls und DEFERRED erst zum Transaktionsende.", "solution": "true"}, {"text": "In SQL gibt es 5 CONSTRAINTs mittels denen die Datenintegrität gesichert werden kann:\n[NOT] NULL, PRIMARY KEY, UNIQUE KEY, FOREIGN KEY, CHECK.", "solution": "true"}]}]